---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerKey.CategoryName
source: html/9c22f632-e952-d80c-4bd1-98c57edd0654.htm
---
# Autodesk.Revit.DB.ExportLayerKey.CategoryName Property

The category name.

## Syntax (C#)
```csharp
public string CategoryName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null